app/controllers/home_controller.rb

  def catalog
  	@products = Product.all
---
SELECT "products".* FROM "products"

  def productSearch
    if !params[:searchInput].nil?
      @searchInput = params[:searchInput]
      @searchCriteria = "%#{params[:searchInput]}%"
      @productList = Product.where("description like :search or name like :search", search: @searchCriteria)
---
SELECT "products".* FROM "products" WHERE (description like '%heart%' or name like '%heart%')