app/controllers/vendors_controller.rb

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_vendor
      @vendor = Vendor.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."vendor_id" = ?  [["vendor_id", 1]]
---
    def set_product
      @product = Product.find(params[:id])